[
  {
    "id": 1,
    "title": "قصة نبي الله إبراهيم عليه السلام",
    "category": "prophets",
    "content": "كان إبراهيم عليه السلام يعيش في قوم يعبدون الأصنام، وكان والده يصنعها. نشأ إبراهيم على التوحيد، وبدأ يدعو قومه لعبادة الله وحده. عندما رأى أن قومه لا يستجيبون، قرر أن يكسر الأصنام في غياب قومه. عندما عادوا ووجدوا الأصنام مكسورة، سألوا إبراهيم من فعل هذا؟ فقال لهم: اسألوا كبيرهم هذا - وأشار إلى أكبر صنم. فقالوا: كيف نسأله وهو لا يتكلم؟ فقال إبراهيم: فكيف تعبدون ما لا يسمع ولا يبصر ولا ينفع ولا يضر؟",
    "lesson": "العبرة من القصة: التوحيد هو أساس الإيمان، ولا يجوز عبادة غير الله. يجب أن نعبد الله وحده لأنه الخالق القادر على كل شيء، بينما الأصنام لا تنفع ولا تضر.",
    "source": "من القرآن الكريم وسيرة الأنبياء"
  },
  {
    "id": 2,
    "title": "قصة نبي الله يوسف عليه السلام",
    "category": "prophets",
    "content": "كان يوسف عليه السلام أحب أبناء يعقوب إليه. حسده إخوته وألقوه في البئر. ثم بيع في مصر كعبد. تعرض للفتنة من امرأة العزيز، لكنه اختار السجن على المعصية. في السجن فسر رؤيا الملك، فخرج وأصبح عزيز مصر. عندما جاء إخوته طالبين الطعام، عرفهم لكنهم لم يعرفوه. في النهاية كشف عن نفسه وقال: لا تثريب عليكم اليوم، يغفر الله لكم.",
    "lesson": "العبرة من القصة: الصبر على البلاء، والعفو عند المقدرة، والثقة في أن الله سينصر المؤمنين. الصبر والاستقامة تؤديان إلى النجاة والرفعة.",
    "source": "سورة يوسف"
  },
  {
    "id": 3,
    "title": "قصة نبي الله موسى عليه السلام",
    "category": "prophets",
    "content": "ولد موسى في وقت كان فرعون يقتل فيه أبناء بني إسرائيل. ألقته أمه في اليم خوفاً عليه، فالتقطته امرأة فرعون وتربى في القصر. عندما كبر، قتل مصرياً بالخطأ، فهرب إلى مدين. هناك تزوج وتوكل على الله. عندما عاد إلى مصر، أمره الله أن يذهب إلى فرعون ليدعوه للإيمان. واجه فرعون بمعجزات الله، وأخرج بني إسرائيل من مصر.",
    "lesson": "العبرة من القصة: الله يحفظ أولياءه ولو في بيوت أعدائهم. التوكل على الله والثقة في نصره. الدعوة إلى الله تحتاج صبراً وشجاعة.",
    "source": "سورة طه وسورة القصص"
  },
  {
    "id": 4,
    "title": "قصة نبي الله نوح عليه السلام",
    "category": "prophets",
    "content": "دعا نوح قومه إلى عبادة الله تسعمائة وخمسين سنة، لكن أكثرهم كفروا. استمر في الدعوة بالليل والنهار، سراً وعلانية، لكنهم ازدادوا كفراً وعناداً. عندما يئس منهم، دعا ربه أن لا يترك على الأرض من الكافرين ديار. أمره الله أن يصنع السفينة، فصنعها وسخر منه قومه. عندما جاء الطوفان، ركب المؤمنون السفينة ونجوا، وغرق الكافرون.",
    "lesson": "العبرة من القصة: الصبر في الدعوة إلى الله، وعدم اليأس من هداية الناس. لكن عندما ييأس الداعية، فإن الله ينصره. الصبر والثبات على الحق من أعظم الفضائل.",
    "source": "سورة نوح وسورة هود"
  },
  {
    "id": 5,
    "title": "قصة هجرة الرسول صلى الله عليه وسلم",
    "category": "prophet_life",
    "content": "عندما اشتد أذى المشركين على المسلمين في مكة، أمر الله رسوله بالهجرة إلى المدينة. خرج النبي صلى الله عليه وسلم مع أبي بكر الصديق، واختبأا في غار ثور ثلاثة أيام. المشركون يبحثون عنهما، حتى وصلوا إلى باب الغار. قال أبو بكر: لو نظر أحدهم تحت قدميه لرآنا. فقال النبي: ما ظنك باثنين الله ثالثهما؟ ثم واصلا رحلتهما إلى المدينة، حيث استقبله المسلمون بفرح عظيم.",
    "lesson": "العبرة من القصة: التوكل على الله في أصعب المواقف. الله يحفظ أولياءه. الصديق الوفي مثل أبي بكر نعمة عظيمة. الهجرة من أجل الدين جهاد عظيم.",
    "source": "السيرة النبوية"
  },
  {
    "id": 6,
    "title": "قصة بلال بن رباح رضي الله عنه",
    "category": "companions",
    "content": "كان بلال عبداً حبشياً لأمية بن خلف. عندما أسلم، عذبه سيده أشد العذاب. كان يضعه في حر الصحراء على الرمال الحارقة، ويضع الصخرة على صدره ويقول: لا تزال هكذا حتى تموت أو تكفر بمحمد. وكان بلال يقول: أحد أحد. اشتراه أبو بكر وأعتقه. أصبح بلال أول مؤذن في الإسلام، وصاحب صوت جميل في الأذان.",
    "lesson": "العبرة من القصة: الصبر على العذاب في سبيل الله. الإيمان القوي لا يهزه عذاب. الحرية الحقيقية هي حرية القلب بالإيمان. الإسلام يساوي بين الناس جميعاً.",
    "source": "السيرة النبوية"
  },
  {
    "id": 7,
    "title": "قصة خالد بن الوليد رضي الله عنه",
    "category": "companions",
    "content": "كان خالد بن الوليد من أشد أعداء الإسلام، وقاتل المسلمين في معركة أحد. لكن عندما أسلم، أصبح من أعظم قادة المسلمين. قال له النبي: الحمد لله الذي هداك، لقد كنت أرى لك عقلاً رجوت ألا يسلمك إلا إلى خير. أصبح خالد سيف الله المسلول، وقاد المسلمين في معارك عديدة وانتصر عليهم.",
    "lesson": "العبرة من القصة: الإسلام يغفر الذنوب جميعاً. الهداية بيد الله. من كان عدوّاً للإسلام يمكن أن يصبح من أعظم أبطاله. التوبة والرجوع إلى الله مقبول في أي وقت.",
    "source": "السيرة النبوية"
  },
  {
    "id": 8,
    "title": "قصة عمر بن الخطاب رضي الله عنه",
    "category": "companions",
    "content": "كان عمر قبل إسلامه من أشد الناس عداوة للمسلمين. خرج يوماً يريد قتل النبي صلى الله عليه وسلم، فقيل له: أختك وصفوان قد أسلما. ذهب إلى بيت أخته غاضباً، وضربها. عندما رأى الدم يسيل، ندم وطلب أن يقرأ ما عندها من قرآن. قرأ من سورة طه، فاهتز قلبه وقال: ما أحسن هذا الكلام! ذهب إلى النبي وأسلم. أصبح عمر من أعظم الصحابة، وأمير المؤمنين.",
    "lesson": "العبرة من القصة: القرآن يهدي القلوب. الهداية تأتي من حيث لا نحتسب. العدل والورع من صفات المؤمن الحق. القوة في الحق خير من القوة في الباطل.",
    "source": "السيرة النبوية"
  },
  {
    "id": 9,
    "title": "قصة أبو بكر الصديق رضي الله عنه",
    "category": "companions",
    "content": "كان أبو بكر أول من أسلم من الرجال، وأول من صدق النبي في الإسراء والمعراج. أنفق ماله كله في سبيل الله، واشترى العبيد وأعتقهم. في الهجرة كان رفيق النبي وثاني اثنين. عندما تولى الخلافة، قاتل المرتدين وحفظ الإسلام. كان يقول: والله لو منعوني عقالاً كانوا يؤدونه لرسول الله لقاتلتهم عليه.",
    "lesson": "العبرة من القصة: الصدق والإخلاص في الإيمان. الإنفاق في سبيل الله من أعظم القربات. الوفاء للرسول والثبات على الحق. القيادة الحكيمة تحتاج إلى إيمان قوي.",
    "source": "السيرة النبوية"
  },
  {
    "id": 10,
    "title": "قصة عثمان بن عفان رضي الله عنه",
    "category": "companions",
    "content": "كان عثمان من أغنى الصحابة، وأنفق الكثير في سبيل الله. في غزوة تبوك، جهز ثلث الجيش على نفقته. اشترى بئر رومة وجعلها للمسلمين يشربون منها مجاناً. كان حيياً جداً، حتى أن الملائكة تستحي منه. تولى الخلافة وكان عادلاً رحيماً. استشهد وهو يقرأ القرآن.",
    "lesson": "العبرة من القصة: الإنفاق في سبيل الله من علامات الإيمان. الحياء من الإيمان. الشهادة في سبيل الله من أعظم المنازل. العفة والطهارة من صفات المؤمن.",
    "source": "السيرة النبوية"
  },
  {
    "id": 11,
    "title": "قصة علي بن أبي طالب رضي الله عنه",
    "category": "companions",
    "content": "كان علي أول من أسلم من الصبيان. نام في فراش النبي ليلة الهجرة ليحميه. كان شجاعاً في المعارك، وفارساً لا يشق له غبار. في غزوة خيبر، قال النبي: لأعطين الراية رجلاً يحب الله ورسوله ويحبه الله ورسوله. فدعا علياً وأعطاه الراية، ففتح خيبر. كان عالماً فقيهاً، وقال فيه النبي: أنا مدينة العلم وعلي بابها.",
    "lesson": "العبرة من القصة: الشجاعة في سبيل الله. التضحية بالنفس لحماية الرسول. العلم والجهاد يجتمعان في المؤمن. حب الله ورسوله من أعظم الفضائل.",
    "source": "السيرة النبوية"
  },
  {
    "id": 12,
    "title": "قصة السيدة خديجة رضي الله عنها",
    "category": "companions",
    "content": "كانت خديجة سيدة قريش وأغناها. عندما سمعت عن صدق وأمانة محمد صلى الله عليه وسلم، أرسلته في تجارة لها. ربح كثيراً، وعرضت عليه الزواج فوافق. كانت أول من آمن به عندما نزل عليه الوحي. وقفت معه في أصعب الأوقات، وأنفقت كل مالها في سبيل الدعوة. قال عنها النبي: آمنت بي حين كذبني الناس، وواستني بمالها حين حرمني الناس.",
    "lesson": "العبرة من القصة: المرأة الصالحة عون للرجل في الخير. الدعم المعنوي والمادي للدعوة. الصبر مع الزوج في الشدة. الإيمان القوي يظهر في الأزمات.",
    "source": "السيرة النبوية"
  },
  {
    "id": 13,
    "title": "موعظة: الصبر على البلاء",
    "category": "sermons",
    "content": "قال الله تعالى: 'وَلَنَبْلُوَنَّكُمْ بِشَيْءٍ مِّنَ الْخَوْفِ وَالْجُوعِ وَنَقْصٍ مِّنَ الْأَمْوَالِ وَالْأَنفُسِ وَالثَّمَرَاتِ ۗ وَبَشِّرِ الصَّابِرِينَ'. البلاء سنة من سنن الله في الحياة. المؤمن يبتلى ليرتفع درجته عند الله. الصبر على البلاء يمحو الذنوب ويرفع الدرجات. من صبر واحتسب، كتب له أجر عظيم.",
    "lesson": "العبرة: البلاء اختبار من الله. الصبر عليه يرفع الدرجات. المؤمن يرضى بقضاء الله. كل بلاء خير للمؤمن إن صبر واحتسب.",
    "source": "القرآن الكريم والحديث الشريف"
  },
  {
    "id": 14,
    "title": "موعظة: أهمية الصدقة",
    "category": "sermons",
    "content": "قال النبي صلى الله عليه وسلم: 'ما نقصت صدقة من مال'. الصدقة تبارك المال وتزيده. من أنفق في سبيل الله، عوضه الله خيراً. الصدقة تطفئ غضب الرب، وتدفع البلاء، وتزيد في العمر. ولو كانت تمرة، ففيها أجر عظيم. الصدقة في السر أفضل من العلانية، لكن كلاهما خير.",
    "lesson": "العبرة: الصدقة لا تنقص المال بل تزيده بركة. الإنفاق في سبيل الله استثمار في الآخرة. الصدقة تدفع البلاء. الإخلاص في الصدقة أهم من الكثرة.",
    "source": "الحديث الشريف"
  },
  {
    "id": 15,
    "title": "موعظة: بر الوالدين",
    "category": "sermons",
    "content": "قال الله تعالى: 'وَقَضَىٰ رَبُّكَ أَلَّا تَعْبُدُوا إِلَّا إِيَّاهُ وَبِالْوَالِدَيْنِ إِحْسَانًا'. بر الوالدين من أعظم العبادات بعد التوحيد. الجنة تحت أقدام الأمهات. من أطاع والديه دخل الجنة، ومن عصاهما دخل النار. حتى في الجهاد، إذا استأذن الوالدان، يجب طاعتهما. الإحسان للوالدين ولو كانا كافرين، لكن لا طاعة في معصية الله.",
    "lesson": "العبرة: بر الوالدين واجب شرعي. الجنة تحت أقدام الأمهات. طاعة الوالدين في المعروف من أسباب دخول الجنة. الإحسان إليهما ولو كانا كافرين.",
    "source": "القرآن الكريم والحديث الشريف"
  },
  {
    "id": 16,
    "title": "موعظة: أهمية الصلاة",
    "category": "sermons",
    "content": "الصلاة عماد الدين، من أقامها أقام الدين، ومن هدمها هدم الدين. الصلاة أول ما يحاسب عليه العبد يوم القيامة. الصلاة نور للمؤمن، وبراءة من النفاق. من حافظ على الصلاة، حفظه الله. الصلاة تنهى عن الفحشاء والمنكر. خمس صلوات في اليوم والليلة يمحون بها الخطايا.",
    "lesson": "العبرة: الصلاة عماد الدين. المحافظة عليها من علامات الإيمان. الصلاة تنهى عن الفحشاء والمنكر. من أقام الصلاة أقام الدين.",
    "source": "الحديث الشريف"
  },
  {
    "id": 17,
    "title": "موعظة: فضل القرآن الكريم",
    "category": "sermons",
    "content": "قال النبي صلى الله عليه وسلم: 'خيركم من تعلم القرآن وعلمه'. القرآن شفاء وهدى ورحمة. من قرأ حرفاً من القرآن، فله به حسنة، والحسنة بعشر أمثالها. القرآن يشفع لصاحبه يوم القيامة. بيت يقرأ فيه القرآن يضيء لأهل السماء كما تضيء النجوم لأهل الأرض.",
    "lesson": "العبرة: تعلم القرآن وتعليمه من أفضل الأعمال. القرآن شفاء للقلوب. كل حرف بحسنة والحسنة بعشر أمثالها. القرآن يرفع صاحبه في الدنيا والآخرة.",
    "source": "الحديث الشريف"
  },
  {
    "id": 18,
    "title": "قصة نبي الله آدم عليه السلام",
    "category": "prophets",
    "content": "خلق الله آدم من طين، ونفخ فيه من روحه، وعلمه الأسماء كلها. أمر الملائكة أن يسجدوا له، فسجدوا إلا إبليس أبى واستكبر. أسكن الله آدم وحواء الجنة، ونهاهما عن أكل شجرة معينة. لكن الشيطان وسوس لهما، فأكلا منها. تاب آدم فتاب الله عليه. نزل آدم إلى الأرض، وأصبح خليفة الله فيها.",
    "lesson": "العبرة من القصة: التوبة مقبولة ما دام العبد حياً. الاستكبار طريق الشيطان. طاعة الله تجلب الخير، والمعصية تجلب الندم. الإنسان خليفة الله في الأرض.",
    "source": "سورة البقرة"
  },
  {
    "id": 19,
    "title": "قصة نبي الله عيسى عليه السلام",
    "category": "prophets",
    "content": "ولد عيسى من مريم العذراء بمعجزة من الله. تكلم في المهد، وأيده الله بمعجزات عظيمة: يخلق من الطين كهيئة الطير، ويبرئ الأكمه والأبرص، ويحيي الموتى بإذن الله. دعا قومه إلى عبادة الله وحده، لكن أكثرهم كفروا. رفعه الله إليه، ولم يقتلوه كما زعموا.",
    "lesson": "العبرة من القصة: قدرة الله لا حدود لها. المعجزات تأتي من عند الله. الدعوة إلى التوحيد واجبة على كل نبي. الله يحفظ أولياءه.",
    "source": "سورة آل عمران وسورة مريم"
  },
  {
    "id": 20,
    "title": "قصة الصحابي الجليل سلمان الفارسي رضي الله عنه",
    "category": "companions",
    "content": "كان سلمان من بلاد فارس، وترك دين آبائه بحثاً عن الحق. تنقل بين الأديرة والرهبان، حتى دلوه على نبي يخرج في أرض العرب. سافر إلى المدينة، واشتراه يهودي. عمل في زراعة النخيل حتى جمع ثمن نفسه. عندما جاء النبي صلى الله عليه وسلم، عرفه من علامات أخبره بها الراهب. أسلم وأصبح من كبار الصحابة. قال النبي: سلمان منا أهل البيت.",
    "lesson": "العبرة من القصة: البحث عن الحق فضيلة. الصبر في طلب الهداية. العمل الشريف لا يقلل من قدر الإنسان. الإسلام يجمع الناس من كل الأجناس.",
    "source": "السيرة النبوية"
  }
]
